{"files":[{"filename":"schema-01-actors.prisma","namespace":"Actors","models":[{"name":"mood_diary_diaryusers","description":"Represents the logical owner/actor of the Mood Diary. This model currently supports a single diary user, matching the app's business logic of a single-user system. It is the reference point for all mood entries via foreign keys and ensures the actor boundary is clear. By encapsulating user context here, future expansion to a multi-user scenario or advanced metadata storage is simplified. Fields are minimized as only a logical system user is required.","material":false,"stance":"primary","primaryField":{"name":"id","type":"uuid","description":"Primary Key."},"foreignFields":[],"plainFields":[{"name":"created_at","type":"datetime","description":"Timestamp indicating when the diary user was (theoretically) created. Used for future extensibility and auditability, even if only a single logical user exists.","nullable":false}],"uniqueIndexes":[],"plainIndexes":[{"fieldNames":["created_at"]}],"ginIndexes":[]}]},{"filename":"schema-02-diaries.prisma","namespace":"Diaries","models":[{"name":"mood_diary_mood_entries","description":"This table stores each mood diary entry, representing the core journaling activity in the Mood Diary application. Each entry records a mood selected from a fixed set of 8 types, an optional note (up to 500 Unicode characters), an automatic creation timestamp, and an \"archived\" status indicating if the entry is older than 30 days (and therefore excluded from listings and summaries). Entries are immutable: once created, they cannot be edited or deleted. Each entry references the logical diary user in the system ({@link mood_diary_diaryusers}), supporting future extensibility for multi-user scenarios. All mood and archiving business rules are strictly enforced in application logic.","material":false,"stance":"primary","primaryField":{"name":"id","type":"uuid","description":"Primary Key."},"foreignFields":[{"name":"mood_diary_diaryuser_id","type":"uuid","description":"References the logical mood diary user. {@link mood_diary_diaryusers.id}.","relation":{"name":"diaryUser","targetModel":"mood_diary_diaryusers"},"unique":false,"nullable":false}],"plainFields":[{"name":"mood_type","type":"string","description":"Mood type selected for this entry, must be one of: happy, sad, anxious, excited, angry, calm, stressed, tired. Enforced via application logic.","nullable":false},{"name":"note","type":"string","description":"Optional freeform note for this entry, max 500 Unicode characters. May be blank or null.","nullable":true},{"name":"created_at","type":"datetime","description":"Timestamp when this entry was created (auto-set, UTC, immutable, used for archiving and queries).","nullable":false},{"name":"archived","type":"boolean","description":"Indicates if this entry has been archived (i.e., older than 30 days, as determined by background process). Archived entries are hidden from listings/statistics.","nullable":false}],"uniqueIndexes":[],"plainIndexes":[{"fieldNames":["mood_type"]},{"fieldNames":["created_at"]},{"fieldNames":["archived"]}],"ginIndexes":[{"fieldName":"note"}]}]}]}